Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_05 (number 106), USER_LED */
/* Routed pin properties */
#define BOARD_INITPINS_RUN_LED_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_RUN_LED_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RUN_LED_CHANNEL                                        5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RUN_LED_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RUN_LED_GPIO_PIN                                       5U   /*!< GPIO pin number */
#define BOARD_INITPINS_RUN_LED_GPIO_PIN_MASK                          (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RUN_LED_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RUN_LED_PIN                                            5U   /*!< PORT pin number */
#define BOARD_INITPINS_RUN_LED_PIN_MASK                               (1U << 5U)   /*!< PORT pin mask */

/* GPIO_AD_B0_06 (number 105), UART1_TXD/J17[6] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< Signal name */

/* GPIO_AD_B0_07 (number 101), UART1_RXD/J17[4] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< Signal name */

/* GPIO_EMC_22 (number 136), CD4052B_CHA */
/* Routed pin properties */
#define BOARD_INITPINS_CD4052_CHA_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_CD4052_CHA_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CD4052_CHA_CHANNEL                                    22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CD4052_CHA_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CD4052_CHA_GPIO_PIN                                   22U   /*!< GPIO pin number */
#define BOARD_INITPINS_CD4052_CHA_GPIO_PIN_MASK                      (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CD4052_CHA_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CD4052_CHA_PIN                                        22U   /*!< PORT pin number */
#define BOARD_INITPINS_CD4052_CHA_PIN_MASK                           (1U << 22U)   /*!< PORT pin mask */

/* GPIO_EMC_23 (number 133), CD4052B_CHB */
/* Routed pin properties */
#define BOARD_INITPINS_CD4052_CHB_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_CD4052_CHB_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CD4052_CHB_CHANNEL                                    23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CD4052_CHB_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CD4052_CHB_GPIO_PIN                                   23U   /*!< GPIO pin number */
#define BOARD_INITPINS_CD4052_CHB_GPIO_PIN_MASK                      (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CD4052_CHB_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CD4052_CHB_PIN                                        23U   /*!< PORT pin number */
#define BOARD_INITPINS_CD4052_CHB_PIN_MASK                           (1U << 23U)   /*!< PORT pin mask */

/* GPIO_EMC_06 (number 12), SEMC_D6/U14[11] */
/* Routed pin properties */
#define BOARD_INITPINS_UART3_TX_PERIPHERAL                               LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_UART3_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_EMC_07 (number 10), SEMC_D7/U14[13] */
/* Routed pin properties */
#define BOARD_INITPINS_UART3_RX_PERIPHERAL                               LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_UART3_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_EMC_33 (number 123), SEMC_D9/U14[44] */
/* Routed pin properties */
#define BOARD_INITPINS_UART4_RX_PERIPHERAL                               LPUART4   /*!< Peripheral name */
#define BOARD_INITPINS_UART4_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_EMC_32 (number 124), SEMC_D8/U14[42] */
/* Routed pin properties */
#define BOARD_INITPINS_UART4_TX_PERIPHERAL                               LPUART4   /*!< Peripheral name */
#define BOARD_INITPINS_UART4_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_EMC_39 (number 117), SEMC_D15/U14[53] */
/* Routed pin properties */
#define BOARD_INITPINS_UART5_RX_PERIPHERAL                               LPUART5   /*!< Peripheral name */
#define BOARD_INITPINS_UART5_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_EMC_38 (number 118), SEMC_D14/U14[51] */
/* Routed pin properties */
#define BOARD_INITPINS_UART5_TX_PERIPHERAL                               LPUART5   /*!< Peripheral name */
#define BOARD_INITPINS_UART5_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_EMC_13 (number 2), SEMC_BA0/U14[20] */
/* Routed pin properties */
#define BOARD_INITPINS_UART6_RX_PERIPHERAL                               LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_UART6_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_EMC_12 (number 3), SEMC_CS0/U14[19] */
/* Routed pin properties */
#define BOARD_INITPINS_UART6_TX_PERIPHERAL                               LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_UART6_TX_SIGNAL                                        TX   /*!< Signal name */

