Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/* GPIO_SD_B0_05 (number 42), SD1_D1/J15[8] */
/* Routed pin properties */
#define BOARD_INITPINS_UART7_RX_PERIPHERAL                               LPUART7   /*!< Peripheral name */
#define BOARD_INITPINS_UART7_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_SD_B0_04 (number 43), SD1_D0/J15[7] */
/* Routed pin properties */
#define BOARD_INITPINS_UART7_TX_PERIPHERAL                               LPUART7   /*!< Peripheral name */
#define BOARD_INITPINS_UART7_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_SD_B1_02 (number 30), I2C4_SCL */
/* Routed pin properties */
#define BOARD_INITPINS_UART8_TX_PERIPHERAL                               LPUART8   /*!< Peripheral name */
#define BOARD_INITPINS_UART8_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_SD_B1_03 (number 28), I2C4_SDA */
/* Routed pin properties */
#define BOARD_INITPINS_UART8_RX_PERIPHERAL                               LPUART8   /*!< Peripheral name */
#define BOARD_INITPINS_UART8_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_SD_B0_00 (number 48), RS485_EN2 */
/* Routed pin properties */
#define BOARD_INITPINS_RS485_EN2_PERIPHERAL                                GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_RS485_EN2_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RS485_EN2_CHANNEL                                     13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS485_EN2_GPIO                                      GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RS485_EN2_GPIO_PIN                                    13U   /*!< GPIO pin number */
#define BOARD_INITPINS_RS485_EN2_GPIO_PIN_MASK                       (1U << 13U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RS485_EN2_PORT                                      GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_EN2_PIN                                         13U   /*!< PORT pin number */
#define BOARD_INITPINS_RS485_EN2_PIN_MASK                            (1U << 13U)   /*!< PORT pin mask */

/* GPIO_SD_B0_01 (number 47), FAN */
/* Routed pin properties */
#define BOARD_INITPINS_FAN_PERIPHERAL                                       TMR2   /*!< Peripheral name */
#define BOARD_INITPINS_FAN_SIGNAL                                   TIMER_OUTPUT   /*!< Signal name */
#define BOARD_INITPINS_FAN_CHANNEL                                            2U   /*!< Signal channel */

/* GPIO_EMC_02 (number 16), SEMC_D2/U14[5] */
/* Routed pin properties */
#define BOARD_INITPINS_IIC1_SCL_PERIPHERAL                                LPI2C1   /*!< Peripheral name */
#define BOARD_INITPINS_IIC1_SCL_SIGNAL                                       SCL   /*!< Signal name */

/* GPIO_EMC_03 (number 15), SEMC_D3/U14[7] */
/* Routed pin properties */
#define BOARD_INITPINS_IIC1_SDA_PERIPHERAL                                LPI2C1   /*!< Peripheral name */
#define BOARD_INITPINS_IIC1_SDA_SIGNAL                                       SDA   /*!< Signal name */

/* GPIO_SD_B1_01 (number 32), CAN1_RX/U9[4] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN1_RX_PERIPHERAL                                   CAN1   /*!< Peripheral name */
#define BOARD_INITPINS_CAN1_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_SD_B1_00 (number 33), CAN1_TX/U9[1] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN1_TX_PERIPHERAL                                   CAN1   /*!< Peripheral name */
#define BOARD_INITPINS_CAN1_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_EMC_09 (number 8), CAN2_RX */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_RX_PERIPHERAL                                   CAN2   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_EMC_08 (number 9), CAN2_TX */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_TX_PERIPHERAL                                   CAN2   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_AD_B0_02 (number 109), GND */
/* Routed pin properties */
#define BOARD_INITPINS_RS485_EN1_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_RS485_EN1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RS485_EN1_CHANNEL                                      2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS485_EN1_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RS485_EN1_GPIO_PIN                                     2U   /*!< GPIO pin number */
#define BOARD_INITPINS_RS485_EN1_GPIO_PIN_MASK                        (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RS485_EN1_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_EN1_PIN                                          2U   /*!< PORT pin number */
#define BOARD_INITPINS_RS485_EN1_PIN_MASK                             (1U << 2U)   /*!< PORT pin mask */

/* GPIO_SD_B0_06 (number 41), RS485_EN3 */
/* Routed pin properties */
#define BOARD_INITPINS_RS485_EN3_PERIPHERAL                                GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_RS485_EN3_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RS485_EN3_CHANNEL                                     19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS485_EN3_GPIO                                      GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RS485_EN3_GPIO_PIN                                    19U   /*!< GPIO pin number */
#define BOARD_INITPINS_RS485_EN3_GPIO_PIN_MASK                       (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RS485_EN3_PORT                                      GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_EN3_PIN                                         19U   /*!< PORT pin number */
#define BOARD_INITPINS_RS485_EN3_PIN_MASK                            (1U << 19U)   /*!< PORT pin mask */

/* GPIO_SD_B1_04 (number 27), RS485_EN4 */
/* Routed pin properties */
#define BOARD_INITPINS_RS485_EN4_PERIPHERAL                                GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_RS485_EN4_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RS485_EN4_CHANNEL                                     24U   /*!< Signal channel */

