Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS485_EN4_GPIO                                      GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RS485_EN4_GPIO_PIN                                    24U   /*!< GPIO pin number */
#define BOARD_INITPINS_RS485_EN4_GPIO_PIN_MASK                       (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RS485_EN4_PORT                                      GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RS485_EN4_PIN                                         24U   /*!< PORT pin number */
#define BOARD_INITPINS_RS485_EN4_PIN_MASK                            (1U << 24U)   /*!< PORT pin mask */

/* GPIO_EMC_40 (number 116), ENET_MDIO/U11[11] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_MDIO_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_MDIO_SIGNAL                                enet_mdio   /*!< Signal name */

/* GPIO_EMC_41 (number 115), ENET_MDC/U11[12] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_MDC_PERIPHERAL                                  ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_MDC_SIGNAL                                  enet_mdc   /*!< Signal name */

/* GPIO_AD_B1_08 (number 82), SEMC_A6/U14[31]/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_INITPINS_UART2_TX_PERIPHERAL                               LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_UART2_TX_SIGNAL                                        TX   /*!< Signal name */

/* GPIO_AD_B1_09 (number 81), SEMC_A7/U14[32]/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_INITPINS_UART2_RX_PERIPHERAL                               LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_UART2_RX_SIGNAL                                        RX   /*!< Signal name */

/* GPIO_AD_B0_08 (number 100), ENET_TX_CLK/U11[9] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TX_CLK_PERIPHERAL                               ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TX_CLK_SIGNAL                           enet_ref_clk   /*!< Signal name */

/* GPIO_AD_B0_10 (number 98), ENET_RXD0/U11[16]/J19[6] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD0_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD0_SIGNAL                             enet_rx_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD0_CHANNEL                                      0U   /*!< Signal channel */

/* GPIO_AD_B0_09 (number 99), ENET_RXD1/U11[15]/J17[3] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD1_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD1_SIGNAL                             enet_rx_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_B0_11 (number 97), ENET_CRS_DV/U11[18]/J19[3] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_CRS_DV_PERIPHERAL                               ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_CRS_DV_SIGNAL                             enet_rx_en   /*!< Signal name */

/* GPIO_AD_B0_12 (number 96), ENET_RXER/U11[20]/J19[4] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXER_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXER_SIGNAL                               enet_rx_er   /*!< Signal name */

/* GPIO_AD_B0_14 (number 94), ENET_TXD0/U11[24]/J17[7] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD0_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD0_SIGNAL                             enet_tx_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD0_CHANNEL                                      0U   /*!< Signal channel */

/* GPIO_AD_B0_15 (number 93), ENET_TXD1/U11[25]/J19[2] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD1_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD1_SIGNAL                             enet_tx_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_B0_13 (number 95), ENET_TXEN/U11[23]/J19[5] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXEN_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXEN_SIGNAL                               enet_tx_en   /*!< Signal name */

/* GPIO_AD_B0_04 (number 107), JTAG_TDO/J16[13]/ENET_RST/U11[32] */
/* Routed pin properties */
#define BOARD_INITPINS_PHY_RST_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_PHY_RST_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_PHY_RST_CHANNEL                                        4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PHY_RST_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_PHY_RST_GPIO_PIN                                       4U   /*!< GPIO pin number */
#define BOARD_INITPINS_PHY_RST_GPIO_PIN_MASK                          (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_PHY_RST_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_PHY_RST_PIN                                            4U   /*!< PORT pin number */
#define BOARD_INITPINS_PHY_RST_PIN_MASK                               (1U << 4U)   /*!< PORT pin mask */

/* GPIO_AD_B1_06 (number 84), ENET_INT/U11[21]/J17[8] */
/* Routed pin properties */
#define BOARD_INITPINS_PHY_INT_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_PHY_INT_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_PHY_INT_CHANNEL                                       22U   /*!< Signal channel */

