Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PHY_INT_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_PHY_INT_GPIO_PIN                                      22U   /*!< GPIO pin number */
#define BOARD_INITPINS_PHY_INT_GPIO_PIN_MASK                         (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_PHY_INT_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_PHY_INT_PIN                                           22U   /*!< PORT pin number */
#define BOARD_INITPINS_PHY_INT_PIN_MASK                              (1U << 22U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (number 79), USB_OTG1_ID/J18[2] */
/* Routed pin properties */
#define BOARD_INITPINS_ADCX_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADCX_SIGNAL                                            IN   /*!< Signal name */
#define BOARD_INITPINS_ADCX_CHANNEL                                          11U   /*!< Signal channel */

/* GPIO_AD_B1_10 (number 80), USB_OTG1_PWR/J18[1] */
/* Routed pin properties */
#define BOARD_INITPINS_ADCY_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADCY_SIGNAL                                            IN   /*!< Signal name */
#define BOARD_INITPINS_ADCY_CHANNEL                                          10U   /*!< Signal channel */

/* GPIO_AD_B1_12 (number 78), USB_OTG1_OC/J18[3] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_G1_T1_PERIPHERAL                                 ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_G1_T1_SIGNAL                                       IN   /*!< Signal name */
#define BOARD_INITPINS_ADC_G1_T1_CHANNEL                                     12U   /*!< Signal channel */

/* GPIO_AD_B1_13 (number 76), CAN_STBY/J18[4] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_G1_T2_PERIPHERAL                                 ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_G1_T2_SIGNAL                                       IN   /*!< Signal name */
#define BOARD_INITPINS_ADC_G1_T2_CHANNEL                                     13U   /*!< Signal channel */

/* GPIO_AD_B1_14 (number 75), I2C1_SCL/U10[17]/J18[6] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_G2_T1_PERIPHERAL                                 ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_G2_T1_SIGNAL                                       IN   /*!< Signal name */
#define BOARD_INITPINS_ADC_G2_T1_CHANNEL                                     14U   /*!< Signal channel */

/* GPIO_AD_B1_15 (number 74), I2C1_SDA/U10[18]/J18[5] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_G2_T2_PERIPHERAL                                 ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_G2_T2_SIGNAL                                       IN   /*!< Signal name */
#define BOARD_INITPINS_ADC_G2_T2_CHANNEL                                     15U   /*!< Signal channel */

/* GPIO_EMC_27 (number 129), K1 */
/* Routed pin properties */
#define BOARD_INITPINS_K1_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K1_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K1_CHANNEL                                            27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K1_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K1_GPIO_PIN                                           27U   /*!< GPIO pin number */
#define BOARD_INITPINS_K1_GPIO_PIN_MASK                              (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K1_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K1_PIN                                                27U   /*!< PORT pin number */
#define BOARD_INITPINS_K1_PIN_MASK                                   (1U << 27U)   /*!< PORT pin mask */

/* GPIO_EMC_26 (number 130), K2 */
/* Routed pin properties */
#define BOARD_INITPINS_K2_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K2_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K2_CHANNEL                                            26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K2_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K2_GPIO_PIN                                           26U   /*!< GPIO pin number */
#define BOARD_INITPINS_K2_GPIO_PIN_MASK                              (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K2_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K2_PIN                                                26U   /*!< PORT pin number */
#define BOARD_INITPINS_K2_PIN_MASK                                   (1U << 26U)   /*!< PORT pin mask */

/* GPIO_EMC_25 (number 131), K3 */
/* Routed pin properties */
#define BOARD_INITPINS_K3_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K3_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K3_CHANNEL                                            25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K3_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K3_GPIO_PIN                                           25U   /*!< GPIO pin number */
#define BOARD_INITPINS_K3_GPIO_PIN_MASK                              (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K3_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K3_PIN                                                25U   /*!< PORT pin number */
#define BOARD_INITPINS_K3_PIN_MASK                                   (1U << 25U)   /*!< PORT pin mask */

/* GPIO_EMC_24 (number 132), K4 */
/* Routed pin properties */
#define BOARD_INITPINS_K4_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K4_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K4_CHANNEL                                            24U   /*!< Signal channel */

