Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K4_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K4_GPIO_PIN                                           24U   /*!< GPIO pin number */
#define BOARD_INITPINS_K4_GPIO_PIN_MASK                              (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K4_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K4_PIN                                                24U   /*!< PORT pin number */
#define BOARD_INITPINS_K4_PIN_MASK                                   (1U << 24U)   /*!< PORT pin mask */

/* GPIO_EMC_21 (number 137), K5 */
/* Routed pin properties */
#define BOARD_INITPINS_K5_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K5_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K5_CHANNEL                                            21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K5_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K5_GPIO_PIN                                           21U   /*!< GPIO pin number */
#define BOARD_INITPINS_K5_GPIO_PIN_MASK                              (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K5_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K5_PIN                                                21U   /*!< PORT pin number */
#define BOARD_INITPINS_K5_PIN_MASK                                   (1U << 21U)   /*!< PORT pin mask */

/* GPIO_EMC_20 (number 138), K6 */
/* Routed pin properties */
#define BOARD_INITPINS_K6_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K6_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K6_CHANNEL                                            20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K6_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K6_GPIO_PIN                                           20U   /*!< GPIO pin number */
#define BOARD_INITPINS_K6_GPIO_PIN_MASK                              (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K6_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K6_PIN                                                20U   /*!< PORT pin number */
#define BOARD_INITPINS_K6_PIN_MASK                                   (1U << 20U)   /*!< PORT pin mask */

/* GPIO_EMC_17 (number 141), K7 */
/* Routed pin properties */
#define BOARD_INITPINS_K7_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K7_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K7_CHANNEL                                            17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K7_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K7_GPIO_PIN                                           17U   /*!< GPIO pin number */
#define BOARD_INITPINS_K7_GPIO_PIN_MASK                              (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K7_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K7_PIN                                                17U   /*!< PORT pin number */
#define BOARD_INITPINS_K7_PIN_MASK                                   (1U << 17U)   /*!< PORT pin mask */

/* GPIO_EMC_16 (number 142), K8 */
/* Routed pin properties */
#define BOARD_INITPINS_K8_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_K8_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_INITPINS_K8_CHANNEL                                            16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_K8_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_K8_GPIO_PIN                                           16U   /*!< GPIO pin number */
#define BOARD_INITPINS_K8_GPIO_PIN_MASK                              (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_K8_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_K8_PIN                                                16U   /*!< PORT pin number */
#define BOARD_INITPINS_K8_PIN_MASK                                   (1U << 16U)   /*!< PORT pin mask */

/* GPIO_AD_B1_00 (number 92), DI_FU1_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_FU1_FB_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DI_FU1_FB_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_FU1_FB_CHANNEL                                     16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_FU1_FB_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_FU1_FB_GPIO_PIN                                    16U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_FU1_FB_GPIO_PIN_MASK                       (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_FU1_FB_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_FU1_FB_PIN                                         16U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_FU1_FB_PIN_MASK                            (1U << 16U)   /*!< PORT pin mask */

/* GPIO_AD_B1_01 (number 91), DI_FU2_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_FU2_FB_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DI_FU2_FB_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_FU2_FB_CHANNEL                                     17U   /*!< Signal channel */

