Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_FU2_FB_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_FU2_FB_GPIO_PIN                                    17U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_FU2_FB_GPIO_PIN_MASK                       (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_FU2_FB_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_FU2_FB_PIN                                         17U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_FU2_FB_PIN_MASK                            (1U << 17U)   /*!< PORT pin mask */

/* GPIO_AD_B1_02 (number 90), DI_K1_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_K1_FB_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DI_K1_FB_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_K1_FB_CHANNEL                                      18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_K1_FB_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_K1_FB_GPIO_PIN                                     18U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_K1_FB_GPIO_PIN_MASK                        (1U << 18U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_K1_FB_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_K1_FB_PIN                                          18U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_K1_FB_PIN_MASK                             (1U << 18U)   /*!< PORT pin mask */

/* GPIO_AD_B1_03 (number 89), DI_K2_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_K2_FB_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DI_K2_FB_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_K2_FB_CHANNEL                                      19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_K2_FB_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_K2_FB_GPIO_PIN                                     19U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_K2_FB_GPIO_PIN_MASK                        (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_K2_FB_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_K2_FB_PIN                                          19U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_K2_FB_PIN_MASK                             (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B1_04 (number 88), DI_K3_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_K3_FB_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DI_K3_FB_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_K3_FB_CHANNEL                                      20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_K3_FB_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_K3_FB_GPIO_PIN                                     20U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_K3_FB_GPIO_PIN_MASK                        (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_K3_FB_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_K3_FB_PIN                                          20U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_K3_FB_PIN_MASK                             (1U << 20U)   /*!< PORT pin mask */

/* GPIO_AD_B1_05 (number 87), DI_K4_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_K4_FB_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DI_K4_FB_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_K4_FB_CHANNEL                                      21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_K4_FB_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_K4_FB_GPIO_PIN                                     21U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_K4_FB_GPIO_PIN_MASK                        (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_K4_FB_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_K4_FB_PIN                                          21U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_K4_FB_PIN_MASK                             (1U << 21U)   /*!< PORT pin mask */

/* GPIO_SD_B0_02 (number 46), DI_GUN1_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_GUN1_FB_PERIPHERAL                               GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DI_GUN1_FB_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_GUN1_FB_CHANNEL                                    15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_GUN1_FB_GPIO                                     GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_GUN1_FB_GPIO_PIN                                   15U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_GUN1_FB_GPIO_PIN_MASK                      (1U << 15U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_GUN1_FB_PORT                                     GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_GUN1_FB_PIN                                        15U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_GUN1_FB_PIN_MASK                           (1U << 15U)   /*!< PORT pin mask */

/* GPIO_SD_B0_03 (number 45), DI_GUN2_FB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_GUN2_FB_PERIPHERAL                               GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DI_GUN2_FB_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_GUN2_FB_CHANNEL                                    16U   /*!< Signal channel */

