Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_GUN2_FB_GPIO                                     GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_GUN2_FB_GPIO_PIN                                   16U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_GUN2_FB_GPIO_PIN_MASK                      (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_GUN2_FB_PORT                                     GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_GUN2_FB_PIN                                        16U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_GUN2_FB_PIN_MASK                           (1U << 16U)   /*!< PORT pin mask */

/* GPIO_AD_B1_07 (number 83), DI_MCB */
/* Routed pin properties */
#define BOARD_INITPINS_DI_MCB_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DI_MCB_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_MCB_CHANNEL                                        23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_MCB_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_MCB_GPIO_PIN                                       23U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_MCB_GPIO_PIN_MASK                          (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_MCB_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_MCB_PIN                                            23U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_MCB_PIN_MASK                               (1U << 23U)   /*!< PORT pin mask */

/* GPIO_EMC_37 (number 119), DI_Door */
/* Routed pin properties */
#define BOARD_INITPINS_DI_Door_PERIPHERAL                                  GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DI_Door_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_Door_CHANNEL                                        5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_Door_GPIO                                        GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_Door_GPIO_PIN                                       5U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_Door_GPIO_PIN_MASK                          (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_Door_PORT                                        GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_Door_PIN                                            5U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_Door_PIN_MASK                               (1U << 5U)   /*!< PORT pin mask */

/* GPIO_EMC_36 (number 120), DI_Water */
/* Routed pin properties */
#define BOARD_INITPINS_DI_Water_PERIPHERAL                                 GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DI_Water_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_Water_CHANNEL                                       4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_Water_GPIO                                       GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_Water_GPIO_PIN                                      4U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_Water_GPIO_PIN_MASK                         (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_Water_PORT                                       GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_Water_PIN                                           4U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_Water_PIN_MASK                              (1U << 4U)   /*!< PORT pin mask */

/* GPIO_EMC_35 (number 121), DI_Hit */
/* Routed pin properties */
#define BOARD_INITPINS_DI_Hit_PERIPHERAL                                   GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_DI_Hit_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_Hit_CHANNEL                                         3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_Hit_GPIO                                         GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_Hit_GPIO_PIN                                        3U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_Hit_GPIO_PIN_MASK                           (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_Hit_PORT                                         GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_Hit_PIN                                             3U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_Hit_PIN_MASK                                (1U << 3U)   /*!< PORT pin mask */

/* GPIO_EMC_34 (number 122), SEMC_D10/U14[45] */
/* Routed pin properties */
#define BOARD_INITPINS_WDI_PFO_PERIPHERAL                                  GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_WDI_PFO_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_WDI_PFO_CHANNEL                                        2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WDI_PFO_GPIO                                        GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_WDI_PFO_GPIO_PIN                                       2U   /*!< GPIO pin number */
#define BOARD_INITPINS_WDI_PFO_GPIO_PIN_MASK                          (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_WDI_PFO_PORT                                        GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_WDI_PFO_PIN                                            2U   /*!< PORT pin number */
#define BOARD_INITPINS_WDI_PFO_PIN_MASK                               (1U << 2U)   /*!< PORT pin mask */

