Sakura-xgs/private_learning/02.Software/01.CCU01/CCU01_APP_RT1021(2025-12-12更换仓库前版本)/02.src/CCU01_DCDC/CCU01_APP_RT1021/board/pin_mux.h
/* GPIO_EMC_00 (number 18), DI_Scram */
/* Routed pin properties */
#define BOARD_INITPINS_DI_Scram_PERIPHERAL                                 GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_DI_Scram_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_Scram_CHANNEL                                       0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_Scram_GPIO                                       GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_Scram_GPIO_PIN                                      0U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_Scram_GPIO_PIN_MASK                         (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_Scram_PORT                                       GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_Scram_PIN                                           0U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_Scram_PIN_MASK                              (1U << 0U)   /*!< PORT pin mask */

/* GPIO_EMC_01 (number 17), DI_SPD */
/* Routed pin properties */
#define BOARD_INITPINS_DI_SPD_PERIPHERAL                                   GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_DI_SPD_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DI_SPD_CHANNEL                                         1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DI_SPD_GPIO                                         GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DI_SPD_GPIO_PIN                                        1U   /*!< GPIO pin number */
#define BOARD_INITPINS_DI_SPD_GPIO_PIN_MASK                           (1U << 1U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DI_SPD_PORT                                         GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DI_SPD_PIN                                             1U   /*!< PORT pin number */
#define BOARD_INITPINS_DI_SPD_PIN_MASK                                (1U << 1U)   /*!< PORT pin mask */

/* GPIO_AD_B0_03 (number 108), JTAG_TDI/J16[5]/WDOG_B */
/* Routed pin properties */
#define BOARD_INITPINS_WDOG_B_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_WDOG_B_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_WDOG_B_CHANNEL                                         3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WDOG_B_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_WDOG_B_GPIO_PIN                                        3U   /*!< GPIO pin number */
#define BOARD_INITPINS_WDOG_B_GPIO_PIN_MASK                           (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_WDOG_B_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_WDOG_B_PIN                                             3U   /*!< PORT pin number */
#define BOARD_INITPINS_WDOG_B_PIN_MASK                                (1U << 3U)   /*!< PORT pin mask */

/* GPIO_EMC_04 (number 14), LED_OUT1 */
/* Routed pin properties */
#define BOARD_INITPINS_LED_OUT1_PERIPHERAL                                  TMR1   /*!< Peripheral name */
#define BOARD_INITPINS_LED_OUT1_SIGNAL                              TIMER_OUTPUT   /*!< Signal name */
#define BOARD_INITPINS_LED_OUT1_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_05 (number 13), LED_OUT2 */
/* Routed pin properties */
#define BOARD_INITPINS_LED_OUT2_PERIPHERAL                                  TMR1   /*!< Peripheral name */
#define BOARD_INITPINS_LED_OUT2_SIGNAL                              TIMER_OUTPUT   /*!< Signal name */
#define BOARD_INITPINS_LED_OUT2_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_10 (number 7), LED_OUT3 */
/* Routed pin properties */
#define BOARD_INITPINS_LED_OUT3_PERIPHERAL                                  TMR1   /*!< Peripheral name */
#define BOARD_INITPINS_LED_OUT3_SIGNAL                              TIMER_OUTPUT   /*!< Signal name */
#define BOARD_INITPINS_LED_OUT3_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_11 (number 4), LED_OUT4 */
/* Routed pin properties */
#define BOARD_INITPINS_LED_OUT4_PERIPHERAL                                  TMR1   /*!< Peripheral name */
#define BOARD_INITPINS_LED_OUT4_SIGNAL                              TIMER_OUTPUT   /*!< Signal name */
#define BOARD_INITPINS_LED_OUT4_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_EMC_18 (number 140), LED_OUT5 */
/* Routed pin properties */
#define BOARD_INITPINS_LED_OUT5_PERIPHERAL                                  TMR2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_OUT5_SIGNAL                              TIMER_OUTPUT   /*!< Signal name */
#define BOARD_INITPINS_LED_OUT5_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_19 (number 139), LED_OUT6 */
/* Routed pin properties */
#define BOARD_INITPINS_LED_OUT6_PERIPHERAL                                  TMR2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_OUT6_SIGNAL                              TIMER_OUTPUT   /*!< Signal name */
#define BOARD_INITPINS_LED_OUT6_CHANNEL                                       1U   /*!< Signal channel */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
